package ru.school57.booktracker.entity

// TODO: добавить аннотацию @Entity
// Этот класс представляет таблицу книг в базе данных
class Book {

    // TODO: добавить поле id (тип Long)
    // Это первичный ключ. Нужно добавить аннотации @Id и @GeneratedValue

    // TODO: добавить поле title (тип String)
    // Это название книги. Обязательное поле, нужно указать ограничение @Column(nullable = false)

    // TODO: добавить поле author (тип String)
    // Это имя автора. Также обязательно для заполнения

    // TODO: добавить поле year (тип Int)
    // Это год издания книги

    // TODO: добавить поле read (тип Boolean)
    // Показывает, прочитал ли пользователь книгу
}