package ru.school57.booktracker.dto

// TODO: добавить поля в BookDto (используйте data class)

// Этот класс используется для обмена данными между клиентом и сервером.
// Поля должны соответствовать информации о книге, которую пользователь может создать, просмотреть или изменить.

data class BookDto(
    // TODO: добавить поле title (тип String)
    // Название книги. Обязательное поле.

    // TODO: добавить поле author (тип String)
    // Имя автора книги. Обязательное поле.

    // TODO: добавить поле year (тип Int)
    // Год издания книги.

    // TODO: добавить поле read (тип Boolean)
    // Признак, прочитана ли книга (true или false)
)

// TODO: реализовать функцию расширения BookDto.toEntity(): Book
// Преобразует DTO в сущность для сохранения в базу данных

// TODO: реализовать функцию расширения Book.toDto(): BookDto
// Преобразует сущность книги из базы в DTO для возврата через API